Autodesk.Revit.DB.View.CanColorFill(Autodesk.Revit.DB.ElementId)
Returns true if elements of category can be colored in the view.
category:
The category Id.
Returns:
True if elements of category can be colored in the view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.View.SupportedColorFillCategoryIds
Returns collection of category Ids that ColorFillScheme could be applied in the view.

Autodesk.Revit.DB.View.CanApplyColorFillScheme(Autodesk.Revit.DB.ElementId)
Returns true if color scheme can be applied to the view, false otherwise.
colorSchemeId:
The color scheme Id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.View.GetColorFillSchemeId(Autodesk.Revit.DB.ElementId)
Returns Id of ColorFillScheme applied to the view.
categoryId:
The Id of category which ColorFillScheme is applied.
Returns:
The Id of ColorFillScheme.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.View.SetColorFillSchemeId(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Applies ColorFillScheme to the view.
Remarks:
Spatial categories can have only one ColorFillScheme assigned for the view.
If there is a scheme assigned for spatial category it will be replaced with the input one.
To get list of categories which support color fill use View.SupportedColorFillCategoryIds().
To check whether category can be color filled in the view use View.CanColorFill().
To check whether there are no settings preventing from applying ColorFillScheme (e.g. Template view) to the view use View.CanApplyColorFillScheme().
categoryId:
The Id of category to apply color scheme.
schemeId:
The Id of scheme.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Elements of category categoryId could not be colored in the view.
-or-
The element schemeId is not ColorFillSchema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.View.GetModelToProjectionTransforms
Gets the transforms from model space to the view projection space.
Remarks:
Model space is the global 3D coordinate space in which the geometry
of the model lives.
View projection space is the 3D Euclidean space with a coordinate system such that
X and Y are horizontal and vertical directions in the view projection plane and Z
is the cross product of X and Y. Distances in the projection space are the same as
would be measured on paper if the view is printed without additional scaling.
Most views will return just one Autodesk.Revit.DB.TransformWithBoundary.  The exceptions are
views with split crop regions.  Split crop regions can be independently moved and therefore
each region of a split crop gets its own transform and boundary.  You can check if a view has split crop
regions by getting the Autodesk.Revit.DB.ViewCropRegionShapeManager and calling ViewCropRegionShapeManager.IsSplit().
When the view's crop region is split, many TransformWithBoundary objects will be returned.
Each TransformWithBoundary corresponds to one region of the split crop. To determine which
TransformWithBoundary to use when converting a model point into view projection space,
first test to see which split crop region boundary contains the model point.
See TransformWithBoundary.GetBoundary().
Returns:
The transformations from model space to view projection space.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The view does not return transforms.
-or-
The view is a perspective view.

Autodesk.Revit.DB.View.HasViewTransforms
Returns true if the view reports model space to view projection space transforms.
Remarks:
Not all views return transforms.  For example, schedules and legends
do not report transforms.
Returns:
True if the view returns transforms, false otherwise.

Autodesk.Revit.DB.View.SetElementOverrides(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.OverrideGraphicSettings)
Sets graphic overrides for an element in the view.
elementId:
Element to override.
overrideGraphicSettings:
An object representing all graphic overrides of the element in view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
elementId is not a valid Element identifier.
-or-
Fill pattern must be a drafting pattern.
-or-
Fill pattern Id must be invalidElementId or point to a LinePattern element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.SetIsFilterEnabled(Autodesk.Revit.DB.ElementId,System.Boolean)
Sets the filter enabled flag.
Remarks:
Several filters can be applied to a view in a sertain order. This enable/disable flag
allows one to quickly turn on/off the action of a particular filter in this view (without
removing the filter from the set of applied filters and loosing the corresponding overrides).
By default, all the filters applied to a view are enabled.
filterElementId:
The ElementId of the filter.
enable:
True if the specified filter should be enabled in this view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Filter is not applied to the view.
-or-
ElementId is not associated with a FilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2021

Autodesk.Revit.DB.View.GetIsFilterEnabled(Autodesk.Revit.DB.ElementId)
Identifies if the filter is enabled in this view.
Remarks:
Several filters can be applied to a view in a certain order. This enable/disable flag
allows one to quickly turn on/off the action of a particular filter in this view (without
removing the filter from the set of applied filters and losing the corresponding overrides).
By default, all the filters applied to a view are enabled.
filterElementId:
The ElementId of the filter.
Returns:
True if the specified filter is enabled in this view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Filter is not applied to the view.
-or-
ElementId is not associated with a FilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2021

Autodesk.Revit.DB.View.AddFilter(Autodesk.Revit.DB.ElementId)
Adds a filter to the view.
Remarks:
The filter will be added with default overrides, which means that there will be no change in the view's display.
The filter is appended as the last filter in the order of filters applied to this view.
filterElementId:
ElementId of the filter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ElementId is not associated with a FilterElement.
-or-
Filter is already applied to the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.SetFilterOverrides(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.OverrideGraphicSettings)
Sets the overrides associated with a filter.
Remarks:
If the filter is not currently applied to the view, this will add the filter with the assigned overrides.
filterElementId:
ElementId of the filter.
overrideGraphicSettings:
The overrides to apply to the filter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ElementId is not associated with a FilterElement.
-or-
Fill pattern must be a drafting pattern.
-or-
Fill pattern Id must be invalidElementId or point to a LinePattern element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.GetOrderedFilters
Gets the filters applied to the view in the order they are applied.
Returns:
The ElementIds of the Filters.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2021

Autodesk.Revit.DB.View.GetFilters
Gets the filters applied to the view.
Remarks:
Note that this method returns filters in a set sorted according to their ids.
To get filters in the order they are applied to the view use Autodesk.Revit.DB.View.GetOrderedFilters.
Returns:
The ElementIds of the Filters.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.IsCategoryOverridable(Autodesk.Revit.DB.ElementId)
Checks whether the category can have graphic overrides in this view.
Remarks:
Categories can be allowed to be overridden in some view types and prohibited from being overridden in others.
E.g., categories cannot be overridden in Autodesk.Revit.DB.ViewType.ProjectBrowser
categoryId:
ElementId of the category.
Returns:
True if category can be overridden, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.View.SetCategoryOverrides(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.OverrideGraphicSettings)
Sets graphic overrides for a category in view.
categoryId:
Category to be overridden
overrideGraphicSettings:
Object representing all graphic overrides of the category categoryId in view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Category cannot be overridden.
-or-
Fill pattern must be a drafting pattern.
-or-
Fill pattern Id must be invalidElementId or point to a LinePattern element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.CanCategoryBeHidden(Autodesk.Revit.DB.ElementId)
Checks whether the category can be hidden in the view.
Remarks:
Categories can be allowed to be hidden in some view types and prohibited from being hidden in others.
E.g., categories cannot be hidden in Autodesk.Revit.DB.ViewType.ProjectBrowser
elementId:
ElementId of the category.
Returns:
True if the category can be hidden, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.View.IsolateElementTemporary(Autodesk.Revit.DB.ElementId)
Set one element to be temporarily isolated in the view.
To isolate a group completely, you must also include all members of all groups and nested groups in your input, therefore you should use the version of this method that accepts multiple element ids as input.
elementId:
Id of element to be isolated.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.IsolateElementsTemporary(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Set multiple elements to be temporarily isolated in the view.
To isolate a group completely, you must also include all members of all groups and nested groups in your input.
elementIds:
Ids of elements to be isolated.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.HideElementsTemporary(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Set multiple elements to be temporarily hidden in the view.
To hide a group completely, you must also include all members of all groups and nested groups in your input.
elementIdSet:
Ids of the elements to be temporarily hidden.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.HideElementTemporary(Autodesk.Revit.DB.ElementId)
Set one element to be temporarily hidden in the view.
To hide a group completely, you must also include all members of all groups and nested groups in your input, therefore you should use the version of this method that accepts multiple element ids as input.
elementId:
The id of the element to be temporarily hidden.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.EnableTemporaryViewPropertiesMode(Autodesk.Revit.DB.ElementId)
Turns Temporary View Properties mode on or off. In this mode, any changes made to the view
are temporary and will be discarded once the mode is disabled.
viewTemplateId:
If the id of a view template is provided, Temporary View Properties mode
is turned on and the settings from the template are applied to the view for the duration of the mode.
If the id provided is not that of a template but the id of the view itself,
Temporary View Properties mode is turned on without any changes to the view.
If ElementId.InvalidElementId is provided, Temporary View Properties mode is turned off.
Returns:
Returns true when the view template provided by viewTemplateId was applied and Temporary View Properties was successfully turned on.
Also returns true if ElementId.InvalidElementId was provided as input and Temporary View Properties was successfully turned off.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View cannot use Temporary View Properties mode in current state.
Since:
2014

Autodesk.Revit.DB.View.HideElements(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the elements to be hidden in the view.
elementIdSet: A set of ElementIds to be hidden.
Remarks: This change is permanent until the elements are unhidden.
All elements in the set must be currently unhidden and must be allowed to be hidden.
An application can check this with Autodesk.Revit.DB.Element.IsHidden(Autodesk.Revit.DB.View) and Autodesk.Revit.DB.Element.CanBeHidden(Autodesk.Revit.DB.View).
Some elements cannot be hidden directly. Examples include: group, array, constraint, edit cut profile, face splitter and link to external documents.To hide a group completely, you must also include all members of all groups and nested groups in your input.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the set of elements to be hidden is empty or one of the elements can not be hidden.
Also thrown when the set of elements to be hidden includes the view itself.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when document regeneration failed.